# What is Groupby in Pandas?

In [2]:
import pandas as pd
import numpy as np

In [3]:
data = {
    'gender': ['m', 'm', 'm', 'f', 'f'],
    'wt': [60, 70, 80, 60, 70],
    'ht': [160, 170, 180, 160, 170]
}

df = pd.DataFrame(data)

In [4]:
df.head()

  gender  wt   ht
0      m  60  160
1      m  70  170
2      m  80  180
3      f  60  160
4      f  70  170

In [5]:
print("Avg wt - ",df['wt'].mean())
print("Avg ht - ",df['ht'].mean())

Avg wt -  68.0
Avg ht -  168.0

In [6]:
df.groupby('gender')['wt'].mean()

gender
f    65.0
m    70.0
Name: wt, dtype: float64

In [7]:
df.groupby('gender')['wt'].min()

gender
f    60
m    60
Name: wt, dtype: int64

In [8]:
df.groupby('gender')['wt'].max()

gender
f    70
m    80
Name: wt, dtype: int64

In [9]:
df.groupby('gender')['wt'].median()

gender
f    65.0
m    70.0
Name: wt, dtype: float64

In [10]:
df.groupby('gender')['wt'].count()

gender
f    2
m    3
Name: wt, dtype: int64

In [11]:
df

  gender  wt   ht
0      m  60  160
1      m  70  170
2      m  80  180
3      f  60  160
4      f  70  170

In [12]:
df.groupby('gender')[['wt','ht']].mean()

          wt     ht
gender
f       65.0  165.0
m       70.0  170.0

In [20]:
df.groupby('gender')[['wt','ht']].max()

        wt   ht
gender
f       70  170
m       80  180

In [ ]:
# wt --> mean
# ht --> max

In [21]:
df

  gender  wt   ht
0      m  60  160
1      m  70  170
2      m  80  180
3      f  60  160
4      f  70  170

In [22]:
df.groupby('gender').agg({'wt':'mean',
                          'ht':'max'})

          wt   ht
gender
f       65.0  170
m       70.0  180